{
  "26009": "Create <b>Steppe Lancer</b> prefixreval Light cavalry unit with increased attack range. Strong in groups. Weak vs. Camel Riders and archers.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed, to Elite Steppe Lancer 900F, 550G (Stable); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26010": "Create <b>Elite Steppe Lancer</b> prefixreval Light cavalry unit with increased attack range. Strong in groups. Weak vs. Camel Riders and archers.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26040": "Create <b>Xolotl Warrior</b> prefixreval Mesoamerican cavalry unit. Strong vs. infantry and siege. Weak vs. Pikemen and Camel Riders. <i> Upgrades: attack (Blacksmith); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26068": "Create <b>Knight</b> prefixreval Powerful all-purpose cavalry. Strong vs. infantry and archers. Weak vs. Pikemen, Camel Riders, and Monks.<i> Upgrades: attack, armor (Blacksmith); speed, hit points, to Cavalier 300F, 300G (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26070": "Create <b>Cavalier</b> prefixreval Powerful all-purpose cavalry. Strong vs. infantry and archers. Weak vs. Pikemen, Camel Riders, and Monks.<i> Upgrades: attack, armor (Blacksmith); speed, hit points, to Paladin 1300F, 750G (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26078": "Create <b>Spearman</b> prefixreval Anti-cavalry infantry unit. Strong vs. mounted units, especially elephants. Weak vs. archers and infantry.<i> Upgrades: attack, armor (Blacksmith); speed, to Pikeman 215F, 90G (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26079": "Create <b>Militia</b> prefixreval All-purpose infantry unit. Strong vs. buildings and infantry. Weak vs. archers at long range.<i> Upgrades: attack, armor (Blacksmith); cost, speed, to Man-at-Arms 100F, 40G (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26080": "Create <b>Man-at-Arms</b> prefixreval All-purpose infantry unit. Strong vs. buildings and infantry. Weak vs. archers at long range.<i> Upgrades: attack, armor (Blacksmith); cost, speed, to Long Swordsman 150F, 65G (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26081": "Create <b>Long Swordsman</b> prefixreval All-purpose infantry unit. Strong vs. buildings and infantry. Weak vs. archers at long range.<i> Upgrades: attack, armor (Blacksmith); cost, speed, to Two-Handed Swordsman 300F, 100G (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26083": "Create <b>Archer</b> prefixreval Ranged unit. Strong vs. units at long range. Weak vs. Skirmishers and units at close range.<i> Upgrades: attack, range, armor (Blacksmith); attack, accuracy (University); accuracy, to Crossbowman 175F, 125G (Archery Range); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26084": "Create <b>Crossbowman</b> prefixreval Ranged unit. Strong vs. units at long range. Weak vs. Elite Skirmishers, Mangonels, and units at close range.<i> Upgrades: attack, range, armor (Blacksmith); attack, accuracy (University); accuracy, to Arbalester 450F, 400G (Archery Range); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26085": "Create <b>Cavalry Archer</b> prefixreval Mounted archer. Strong vs. slow units at long range. Weak vs. Elite Skirmishers and units at close range.<i> Upgrades: speed, hit points (Stable); attack, range, armor (Blacksmith); attack, accuracy (University); accuracy, armor, to Heavy Cavalry Archer 900F, 500G (Archery Range); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26086": "Create <b>Hand Cannoneer</b> prefixreval Gunpowder unit with powerful attack, but inaccurate at long range. Strong vs. infantry. Weak vs. Elite Skirmishers and archers.<i> Upgrades: armor (Blacksmith); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26087": "Create <b>Elite Skirmisher</b> prefixreval Ranged anti-archer unit that cannot attack at close range. Strong vs. archers. Weak vs. units at close range.<i> Upgrades: attack, range, armor (Blacksmith); attack, accuracy (University); accuracy, to Imperial Skirmisher 300W, 450G (Archery Range); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26088": "Create <b>Skirmisher</b> prefixreval Ranged anti-archer unit that cannot attack at close range. Strong vs. archers. Weak vs. units at close range.<i> Upgrades: attack, range, armor (Blacksmith); attack, accuracy (University); accuracy, to Elite Skirmisher 230W, 130G (Archery Range); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26089": "Build <b>Trade Cog</b> prefixreval Trade unit used for generating gold at another player's Dock. To trade, click the Trade Cog then right-click another player's Dock. Will return with gold to your Dock.<i> Upgrades: generate more gold (Market); armor, cost (Dock); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26090": "Build <b>Fishing Ship</b> prefixreval Gathers food from fish and Fish Traps. Builds Fish Traps.<i> Upgrades: armor, cost, speed, efficiency (Dock); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26091": "Build <b>War Galley</b> prefixreval All-purpose warship with ranged attack. Weak vs. Fire Ships.<i> Upgrades: armor, cost, speed, to Galleon 400F, 315W (Dock); attack, range (Blacksmith); attack, accuracy (University); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26093": "Build <b>Bombard Cannon</b> prefixreval Siege weapon with long range. Strong vs. buildings and siege weapons. Weak vs. melee units.<i> Upgrades: attack, range (University); to Houfnice 950F, 750G (Siege Workshop); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26094": "Build <b>Battering Ram</b> prefixreval Anti-building siege weapon. Resistant to most ranged attacks. Garrisoned infantry increase speed and attack.<i> Upgrades: attack (University); to Capped Ram 300F (Siege Workshop); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range› ‹garrison›",
  "26095": "Build <b>Mangonel</b> prefixreval Ranged siege weapon with area of effect attack, but cannot attack enemies at close range. Strong vs. tight groups of units. Can attack ground.<i> Upgrades: attack, range (University); to Onager 800F, 500G (Siege Workshop); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26096": "Build <b>Scorpion</b> prefixreval Anti-unit siege weapon. Fires bolts that pierce multiple units. Strong vs. large groups of units. Weak vs. cavalry and siege weapons.<i> Upgrades: range, attack (University); to Heavy Scorpion 1000F, 1100W (Siege Workshop); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26097": "Build <b>Trebuchet</b> prefixreval Powerful anti-building siege weapon with long range. Must be packed to move, unpacked to attack. Cannot attack enemies at close range. Strong vs. buildings. Can attack ground and destroy trees.<i> Upgrades: attack, range (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26099": "Create <b>Monk</b> prefixreval Converts enemy units to your civilization. Heals friendly units (except ships and siege weapons). Strong vs. slow and non-ranged units. Weak vs. Light Cavalry and ranged units. Can collect Relics and bring them to Monasteries.<i> Upgrades: at Monastery.</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26100": "Build <b>Trade Cart</b> prefixreval Trade unit used for generating gold at another player's Market. To trade, click the Trade Cart then right-click another player's Market. Will return with gold to your Market.<i> Upgrades: generate more gold (Market); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26101": "Create <b>Cataphract</b> prefixreval Byzantine unique cavalry unit. Strong vs. infantry. Weak vs. archers. <i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed, to Elite Cataphract 1200F, 800G (Castle); more resistant to Monks.</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26102": "Create <b>Chu Ko Nu</b> prefixreval Chinese unique archer with rapid-fire attack. Strong vs. infantry. Weak vs. archers and siege weapons. <i> Upgrades: attack, range (Blacksmith); accuracy (Archery Range); attack, accuracy (University); creation speed, to Elite Chu Ko Nu 760F, 760G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26103": "Create <b>Mameluke</b> prefixreval Saracen unique camel unit with ranged melee attack. Strong vs. cavalry. Weak vs. archers and Pikemen. <i> Upgrades: attack, armor (Blacksmith); speed, hit points  (Stable); creation speed, to Elite Mameluke 600F, 500G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26104": "Create <b>Huskarl</b> prefixreval Gothic unique infantry unit with high pierce armor. Strong vs. archers and buildings. Weak vs. cavalry. <i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed, to Elite Huskarl 1200F, 550G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26105": "Create <b>Janissary</b> prefixreval Turkish unique hand cannoneer with longer range and no minimum range. Strong vs. infantry. Weak vs. archers.<i> Upgrades: armor (Blacksmith); creation speed, to Elite Janissary 850F, 750G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26106": "Build <b>Longboat</b> prefixreval Viking unique ship that fires multiple arrows. Strong vs. War Galleys, land units, and buildings. <i> Upgrades: armor, cost, speed, to Elite Longboat 750F, 475G (Dock); attack, range (Blacksmith); attack, accuracy (University); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26107": "Create <b>Longbowman</b> prefixreval British unique archer with very long range. Strong vs. infantry. Weak vs. cavalry and Skirmishers. <i> Upgrades: attack, range, armor (Blacksmith); attack, accuracy (University); creation speed, to Elite Longbowman 850F, 850G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26108": "Create <b>Mangudai</b> prefixreval Mongol unique cavalry archer with fast-firing attack. Strong vs. siege weapons and infantry. Weak vs. Skirmishers, Pikemen, and Camel Riders. <i> Upgrades: attack, range, armor (Blacksmith); speed, hit points (Stable); accuracy, armor (Archery Range); attack, accuracy (University); creation speed, to Elite Mangudai 1100F, 675G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26109": "Create <b>War Elephant</b> prefixreval Persian unique unit. Slow and powerful cavalry. Strong vs. buildings and units at close range. Weak vs. Monks. <i> Upgrades: attack, armor (Blacksmith); speed, hit points  (Stable); creation speed, to Elite War Elephant 1600F, 1200G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26110": "Create <b>Samurai</b> prefixreval Japanese unique infantry unit with fast attack. Strong vs. unique units and infantry. Weak vs. archers. <i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed, to Elite Samurai 750F, 650G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26111": "Create <b>Throwing Axeman</b> prefixreval Frankish unique infantry unit with ranged melee attack. Strong vs. infantry. Weak vs. archers and siege weapons. <i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed, to Elite Throwing Axeman 1000F, 750G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26112": "Create <b>Teutonic Knight</b> prefixreval Teutonic unique infantry unit. Slow and powerful. Strong vs. melee units. Weak vs. archers and Scorpions. <i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed, to Elite Teutonic Knight 950F, 500G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26113": "Create <b>Woad Raider</b> prefixreval Celtic unique infantry unit. Fast-moving. Strong vs. infantry and siege weapons. Weak vs. archers and cavalry. <i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed, to Elite Woad Raider 1000F, 800G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26114": "Create <b>Condottiero</b> prefixreval Fast anti-gunpowder infantry. Strong vs. gunpowder units. Weak vs. cavalry and archers. Trainable by Italians and their allies.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26121": "Create <b>Villager</b> prefixreval Gathers resources. Builds and repairs buildings. Also repairs ships and siege weapons.<i> Upgrades: hit points, armor, efficiency (Town Center); wood resource-gathering (Lumber Camp); stone, gold resource-gathering (Mining Camp); build speed (University); attack (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26129": "Create <b>Organ Gun</b> prefixreval Portuguese unique siege unit. Fires a volley of bullets. Strong vs. large groups of units. Weak vs. cavalry and Mangonels.<i> Upgrades: attack, range (University); creation speed, to Elite Organ Gun 1200F, 500G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26130": "Create <b>Elite Organ Gun</b> prefixreval Portuguese unique siege unit. Fires a volley of bullets. Strong vs. large groups of units. Weak vs. cavalry and Mangonels.<i> Upgrades: attack, range (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26132": "Create <b>Caravel</b> prefixreval Portuguese unique ship that fires bolts that pierce multiple units. Strong vs. large groups of ships. Weak vs. Fire Ships.<i> Upgrades: armor, cost, speed, to Elite Caravel 750F, 475G (Dock); attack, range (Blacksmith); attack, accuracy (University); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26133": "Create <b>Elite Caravel</b> prefixreval Portuguese unique ship that fires bolts that pierce multiple units. Strong vs. large groups of ships. Weak vs. Fire Ships.<i> Upgrades: armor, speed, cost (Dock); attack, range (Blacksmith); attack, accuracy (University); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26134": "Create <b>Camel Archer</b> prefixreval Berber unique mounted archer. Strong vs. Cavalry Archers and infantry. Weak vs. Pikemen, Skirmishers, and Camel Riders.<i> Upgrades: attack, range, armor (Blacksmith); speed, hit points (Stable); accuracy, armor (Archery Range); attack, accuracy (University); creation speed, to Elite Camel Archer 1000W, 500G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26136": "Create <b>Elite Camel Archer</b> prefixreval Berber unique mounted archer. Strong vs. Cavalry Archers and infantry. Weak vs. Pikemen, Skirmishers, and Camel Riders.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); accuracy, armor (Archery Range); attack, accuracy (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26137": "Create <b>Genitour</b> prefixreval Mounted skirmisher. Strong vs. archers. Weak vs. units at close range. Trainable by Berbers and their allies.<i> Upgrades: speed, hit points (Stable); attack, range, armor (Blacksmith); attack, accuracy (University); accuracy, to Elite Genitour 500F, 450W (Archery Range); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26139": "Create <b>Elite Genitour</b> prefixreval Mounted skirmisher. Strong vs. archers. Weak vs. units at close range. Trainable by Berbers and their allies.<i> Upgrades: speed, hit points (Stable); attack, range, armor (Blacksmith); attack, accuracy (University); accuracy (Archery Range); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26140": "Create <b>Gbeto</b> prefixreval Malian unique infantry unit with ranged melee attack. Fast-moving. Strong vs. infantry. Weak vs. archers and siege weapons.<i> Upgrades: armor (Blacksmith); creation speed, to Elite Gbeto 900F, 600G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26141": "Create <b>Elite Gbeto</b> prefixreval Malian unique infantry unit with ranged melee attack. Fast-moving. Strong vs. infantry. Weak vs. archers and siege weapons.<i> Upgrades: armor (Blacksmith); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26143": "Create <b>Shotel Warrior</b> prefixreval Ethiopian unique infantry with high attack and fast training speed. Fast-moving. Strong vs. infantry. Weak vs. archers.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed, to Elite Shotel Warrior 900F, 450G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26144": "Build <b>Dock</b> prefixreval Used to build and upgrade ships, deposit food from Fishing Ships, and trade with other players by sea.<i> Upgrades: line of sight (Town Center); hit points, armor (University); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range› ‹garrison›",
  "26145": "Create <b>Elite Shotel Warrior</b> prefixreval Ethiopian unique infantry with high attack and fast training speed. Fast-moving. Strong vs. infantry. Weak vs. archers.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26146": "Create <b>Ballista Elephant</b> prefixreval Khmer unique elephant equipped with a Scorpion. Can destroy trees. Strong vs. infantry and archers. Weak vs. cavalry and siege weapons.<i> Upgrades: armor (Blacksmith); speed, hit points (Stable); attack, range (University); creation speed, to Elite Ballista Elephant 1000F, 500G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26147": "Create <b>Elite Ballista Elephant</b> prefixreval Khmer unique elephant equipped with a Scorpion. Can destroy trees. Strong vs. infantry and archers. Weak vs. cavalry and siege weapons.<i> Upgrades: armor (Blacksmith); speed, hit points (Stable); attack, range (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26148": "Create <b>Karambit Warrior</b> prefixreval Malay unique infantry unit. Cheap and only takes half a population unit. Strong in high numbers. Weak vs. cavalry and archers.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed, to Elite Karambit Warrior 900F, 600G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26149": "Build <b>Farm</b> prefixreval Renewable food source. Provides a limited amount of food before it goes fallow and must be rebuilt. Only one Villager may work a Farm at a time. You can farm abandoned enemy Farms. Cannot be converted by enemy Monks.<i> Upgrades: food (Mill); hit points (University).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26150": "Create <b>Elite Karambit Warrior</b> prefixreval Malay unique infantry unit. Cheap and only takes half a population unit. Strong in high numbers. Weak vs. cavalry and archers.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26151": "Create <b>Arambai</b> prefixreval Burmese unique cavalry archer with a powerful but inaccurate dart attack. Strong vs. infantry and cavalry. Weak vs. archers.<i> Upgrades: armor (Blacksmith); speed, hit points (Stable); accuracy (University); creation speed, to Elite Arambai 1100F, 675G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26152": "Create <b>Elite Arambai</b> prefixreval Burmese unique cavalry archer with a powerful but inaccurate dart attack. Strong vs. infantry and cavalry. Weak vs. archers.<i> Upgrades: armor (Blacksmith); speed, hit points (Stable); accuracy (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26154": "Build <b>Guard Tower</b> prefixreval Tower with a ranged attack. Units can garrison inside for protection. Ranged Units and Villagers shoot additional projectiles. Strong vs. archers. Weak vs.units at close range, especially Rams.<i> Upgrades: line of sight (Town Center); attack, range (Blacksmith); attack, hit points, armor, ship attack; to Keep 500F, 350W (University).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range› ‹garrison›",
  "26155": "Build <b>Keep</b> prefixreval Tower with a ranged attack. Units can garrison inside for protection. Ranged Units and Villagers shoot additional projectiles. Strong vs. archers. Weak vs.units at close range, especially Rams.<i> Upgrades: line of sight (Town Center); attack, range (Blacksmith); attack, hit points, armor, ship attack (University).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range› ‹garrison›",
  "26156": "Build <b>Bombard Tower</b> prefixreval Gunpowder tower with a powerful ranged attack. Units can garrison inside for protection. Strong vs. ships.<i> Upgrades: line of sight (Town Center); attack, range (Blacksmith); hit points, armor, ship attack (University).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range› ‹garrison›",
  "26159": "Build <b>Feitoria</b> prefixreval Economic building. Generates resources without the need for villagers. Unique building of the Portuguese. Requires 20 population.<i> Upgrades: line of sight (Town Center); hit points, armor (University).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range› ‹garrison›",
  "26160": "Build <b>Fire Galley</b> prefixreval Warship that spews fire at close range. Strong vs. Galleys. Weak vs. Demolition Rafts.<i> Upgrades: armor, speed, cost, to Fire Ship 230F, 100G (Dock); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26162": "Build <b>Demolition Raft</b> prefixreval Demolition ship armed with explosives. Strong vs. Fire Galleys and buildings. Self-destructs when used.<i> Upgrades: armor, speed, cost, to Demolition Ship 230F, 100G (Dock); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26165": "Create <b>Rattan Archer</b> prefixreval Vietnamese unique archer with high pierce armor. Strong vs. archers and infantry. Weak vs. cavalry and Skirmishers.<i> Upgrades: attack, range, armor (Blacksmith); accuracy, armor (Archery Range); attack, accuracy (University); creation speed, to Elite Rattan Archer 1000F, 750G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26166": "Create <b>Elite Rattan Archer</b> prefixreval Vietnamese unique archer with high pierce armor. Strong vs. archers and infantry. Weak vs. cavalry and Skirmishers.<i> Upgrades: attack, range, armor (Blacksmith); accuracy, armor (Archery Range); attack, accuracy (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26167": "Create <b>Battle Elephant</b> prefixreval Slow and heavy cavalry. Strong vs. cavalry, infantry, and archers. Weak vs. Monks and Pikemen.<i> Upgrades: attack, armor (Blacksmith); speed, hit points, to Elite Battle Elephant 1200F, 900G (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26168": "Create <b>Elite Battle Elephant</b> prefixreval Slow and heavy cavalry. Strong vs. cavalry, infantry, and archers. Weak vs. Monks and Pikemen.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26169": "Build <b>Siege Workshop</b> prefixreval Used to build and upgrade siege weapons.<i> Upgrades: line of sight (Town Center); hit points, armor (University); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range› ‹garrison›",
  "26185": "Build <b>Gate</b> prefixreval Can be built into existing walls to allow movement of friendly units. Can be locked and unlocked. Cannot be converted by enemy Monks.<i> Upgrades: line of sight (Town Center); hit points, armor. Researching Fortified Wall (University) increases gate hit points.</i><br>\n‹hp›",
  "26186": "Build <b>Palisade Gate</b> prefixreval Can be built into existing walls to allow movement of friendly units. Can be locked and unlocked. Cannot be converted by enemy Monks.<i> Upgrades: line of sight (Town Center); hit points, armor (university).</i><br>\n‹hp›",
  "26190": "Create <b>Imperial Skirmisher</b> prefixreval Ranged anti-archer unit that cannot attack at close range. Strong vs. archers. Weak vs. units at close range. Trainable by Vietnamese and their allies.<i> Upgrades: attack, range, armor (Blacksmith); attack, accuracy (University); accuracy (Archery Range); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26202": "Build <b>Palisade Wall</b> prefixreval Wooden wall that is cheap and easy to build. Slows down your enemies and warns you of their approach. Cannot be converted by enemy Monks.<i> Upgrades: line of sight (Town Center); hit points, armor (University).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26203": "Build <b>Stone Wall</b> prefixreval Stone wall that is difficult to breach without siege weapons. Slows down your enemies and warns you of their approach. Cannot be converted by enemy Monks.<i> Upgrades: line of sight (Town Center); hit points, armor, to Fortified Wall 200F, 100W (University).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26204": "Build <b>Fortified Wall</b> prefixreval Stone wall that is difficult to breach without siege weapons. Slows down your enemies and warns you of their approach. Cannot be converted by enemy Monks.<i> Upgrades: line of sight (Town Center); hit points, armor (University).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26249": "Build <b>Harbor</b> prefixreval Used to build and upgrade ships, deposit food from Fishing Ships, and trade with other players by sea. Unique building of the Malay. Automatically attacks enemies within range.<i> Upgrades: attack, range (Blacksmith); line of sight (Town Center); attack, accuracy, hit points, armor (University); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range› ‹garrison›",
  "26287": "Build <b>Cannon Galleon</b> prefixreval Anti-building siege warship with long range, but cannot attack enemies at close range. Strong vs. buildings. Weak vs. other units.<i> Upgrades: armor, cost, speed, to Elite Cannon Galleon 525W, 500G (Dock); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26288": "Create <b>Konnik</b> prefixreval Bulgarian unique cavalry unit that fights on as infantry when felled. Strong vs. infantry and archers. Weak vs. Camel Riders and Monks.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed, to Elite Konnik 1000F, 750G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26289": "Build <b>Capped Ram</b> prefixreval Anti-building siege weapon. Resistant to most ranged attacks. Garrisoned infantry increase speed and attack.<i> Upgrades: attack (University); to Siege Ram 1000F (Siege Workshop); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range› ‹garrison›",
  "26290": "Create <b>Elite Konnik</b> prefixreval Bulgarian unique cavalry unit that fights on as infantry when felled. Strong vs. infantry and archers. Weak vs. Camel Riders and Monks.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26309": "Build <b>Galleon</b> prefixreval All-purpose warship with ranged attack. Weak vs. Fire Ships.<i> Upgrades: armor, cost, speed (Dock); attack, range (Blacksmith); attack, accuracy (University); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26313": "Create <b>Keshik</b> prefixreval Tatar unique cavalry unit that generates gold when fighting other units.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed, to Elite Keshik 700F, 900G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26314": "Create <b>Elite Keshik</b> prefixreval Tatar unique cavalry unit that generates gold when fighting other units.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26315": "Create <b>Kipchak</b> prefixreval Cuman unique cavalry archer with rapid-fire attack. Strong vs. infantry. Weak vs. Skirmishers.<i> Upgrades: attack, range, armor (Blacksmith); speed, hit points (Stable); accuracy, armor (Archery Range); attack, accuracy (University); creation speed, to Elite Kipchak 1100F, 1000W (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26326": "Create <b>Scout Cavalry</b> prefixreval Fast cavalry for scouting and raiding. Resistant to conversion. Strong vs. Monks. Weak vs. Pikemen and Camel Riders.<i> Upgrades: attack, armor (Blacksmith); speed, hit points, to Light Cavalry 150F, 50G (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26327": "Create <b>Elite Kipchak</b> prefixreval Cuman unique cavalry archer with rapid-fire attack. Strong vs. infantry. Weak vs. Skirmishers.<i> Upgrades: attack, range, armor (Blacksmith); speed, hit points (Stable); accuracy, armor (Archery Range); attack, accuracy (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26328": "Create <b>Leitis</b> prefixreval Lithuanian unique cavalry unit with attack that ignores armor. Strong vs. armored units.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed, to Elite Leitis 750F, 750G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26329": "Create <b>Elite Leitis</b> prefixreval Lithuanian unique cavalry unit with attack that ignores armor. Strong vs. armored units.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26344": "Build <b>House</b> prefixreval Provides 5 population each. Your current/supportable population is shown at the top of the screen.<i> Upgrades: line of sight (Town Center); hit points, armor (University); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range› ‹garrison›",
  "26375": "Create <b>Flaming Camel</b> prefixreval Incendiary camel loaded with flammable hay and brush. Strong vs. mounted units, especially elephants. Weak vs. archers and infantry. Self-destructs when used.<i> Upgrades: attack (University); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26381": "Build <b>Trebuchet</b> prefixreval Powerful anti-building siege weapon with long range. Must be packed to move, unpacked to attack. Cannot attack enemies at close range. Strong vs. buildings. Can attack ground and destroy trees.<i> Upgrades: attack, range (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26403": "Create <b>Urumi Swordsman</b> prefixreval Dravidian unique infantry unit which can charge its attack. Strong vs. buildings and infantry. Weak vs. archers at long range.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed, to Elite Urumi Swordsman 900F, 450G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26408": "Create <b>Pikeman</b> prefixreval Anti-cavalry infantry unit. Strong vs. mounted units, especially elephants. Weak vs. archers and infantry.<i> Upgrades: attack, armor (Blacksmith); speed, to Halberdier 300F, 600G (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26409": "Create <b>Halberdier</b> prefixreval Anti-cavalry infantry unit. Strong vs. mounted units, especially elephants. Weak vs. archers and infantry.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26411": "Create <b>Two-Handed Swordsman</b> prefixreval All-purpose infantry unit. Strong vs. buildings and infantry. Weak vs. archers at long range.<i> Upgrades: attack, armor (Blacksmith); cost, speed, to Champion 750F, 350G (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26412": "Create <b>Heavy Cavalry Archer</b> prefixreval Mounted archer. Strong vs. slow units at long range. Weak vs. Elite Skirmishers and units at close range.<i> Upgrades: attack, range, armor (Blacksmith); accuracy, armor (Archery Range); attack, accuracy (University); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26413": "Create <b>Elite Urumi Swordsman</b> prefixreval Dravidian unique infantry unit which can charge its attack. Strong vs. buildings and infantry. Weak vs. archers at long range.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26416": "Create <b>Camel Rider</b> prefixreval Fast anti-cavalry unit. Strong vs. cavalry. Weak vs. Spearmen, Monks, and archers.<i> Upgrades: attack, armor (Blacksmith); speed, to Heavy Camel Rider 325F, 360G (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26417": "Create <b>Heavy Camel Rider</b> prefixreval Fast anti-cavalry unit. Strong vs. cavalry. Weak vs. Pikemen, Monks, and archers.<i> Upgrades: attack, armor (Blacksmith); speed, hit points, to Imperial Camel Rider 1000F, 500G  (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26418": "Create <b>Arbalester</b> prefixreval Ranged unit. Strong vs. units at long range. Weak vs. Elite Skirmishers, Onagers, and units at close range.<i> Upgrades: attack, range, armor (Blacksmith); accuracy (Archery Range); attack, accuracy (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26419": "Create <b>Imperial Camel Rider</b> prefixreval Hindustani unique anti-cavalry unit. Fast-moving. Strong vs. cavalry. Weak vs. Pikemen, Monks, and archers.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26421": "Create <b>Chakram Thrower</b> prefixreval Gurjara unique infantry unit with ranged melee attack. Strong vs. infantry. Weak vs. archers and siege weapons. <i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed, to Elite Chakram Thrower 1000F, 650G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26424": "Build <b>Demolition Ship</b> prefixreval Demolition ship armed with explosives. Strong vs. Fire Ships and buildings. Self-destructs when used.<i> Upgrades: armor, speed, cost, to Heavy Demolition Ship 200W, 300G (Dock); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26425": "Build <b>Heavy Demolition Ship</b> prefixreval Demolition ship armed with explosives. Strong vs. Fire Ships and buildings. Self-destructs when used.<i> Upgrades: armor, speed, cost (Dock); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26426": "Build <b>Fire Ship</b> prefixreval Warship that spews fire at close range. Strong vs. War Galleys. Weak vs. Demolition Ships.<i> Upgrades: armor, speed, cost, to Fast Fire Ship 280W, 250G (Dock); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26427": "Create <b>Elite Chakram Thrower</b> prefixreval Gurjara unique infantry unit with ranged melee attack. Strong vs. infantry. Weak vs. archers and siege weapons. <i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26428": "Create <b>Armored Elephant</b> prefixreval Anti-building cavalry unit. Resistant to most ranged attacks. Weak vs. melee units. Cannot be converted by enemy Monks from distance.<i> Upgrades: attack, armor (Blacksmith); attack (University); speed, hit points (Stable); to Siege Elephant 650F (Siege Workshop); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26429": "Build <b>Fast Fire Ship</b> prefixreval Warship that spews fire at close range. Strong vs. War Galleys. Weak vs. Demolition Ships.<i> Upgrades: armor, speed, cost (Dock); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26430": "Create <b>Siege Elephant</b> prefixreval Anti-building cavalry unit. Resistant to most ranged attacks. Weak vs. melee units. Cannot be converted by enemy Monks from distance.<i> Upgrades: attack, armor (Blacksmith); attack (University); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26431": "Create <b>Ghulam</b> prefixreval Hindustani unique infantry unit that thrusts its spear through multiple targets. Strong vs. archers. Weak vs. cavalry. <i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed, to Elite Ghulam 950F, 575G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26432": "Create <b>Elite Ghulam</b> prefixreval Hindustani unique infantry unit that thrusts its spear through multiple targets. Strong vs. archers. Weak vs. cavalry. <i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26435": "Build <b>Thirisadai</b> prefixreval Dravidian unique warship that fires multiple projectiles. Strong vs. warships.<i> Upgrades: armor, speed, cost (Dock); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26436": "Build <b>Galley</b> prefixreval All-purpose warship with ranged attack. Weak vs. Fire Galleys.<i> Upgrades: armor, speed, cost, to War Galley 230F, 100G (Dock); attack, range (Blacksmith); attack, accuracy (University); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26437": "Create <b>Shrivamsha Rider</b> prefixreval Gurjara unique light cavalry unit which can dodge projectiles. Strong vs. archers. Weak vs. Pikemen and Camel Riders.<i> Upgrades: attack, armor (Blacksmith); speed, hit points, to Elite Shrivamsha Rider 850F, 500G (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26438": "Create <b>Elite Shrivamsha Rider</b> prefixreval Gurjara unique light cavalry unit which can dodge projectiles. Strong vs. archers. Weak vs. Pikemen and Camel Riders.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26439": "Build <b>Heavy Scorpion</b> prefixreval Anti-unit siege weapon. Fires bolts that pierce multiple units. Strong vs. large groups of units. Weak vs. cavalry and siege weapons.<i> Upgrades: attack, range (University); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26440": "Build <b>Caravanserai</b> prefixreval Economic building. Heals and increases speed of Trade Carts in a 10 tile radius. Unique building of the Hindustanis.<i> Upgrades: line of sight (Town Center); hit points, armor (University).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range› ‹garrison›",
  "26441": "Create <b>Camel Scout</b> prefixreval Gurjara unique scout unit. Strong vs. cavalry. Weak vs. Pikemen, Monks, and archers.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26443": "Build <b>Transport Ship</b> prefixreval Used to move units across water. Select the units you want to transport, then right-click on the Transport Ship to board them. Use the Unload button to unload units on the shore.<i> Upgrades: armor, speed, cost, capacity (Dock); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26444": "Create <b>Light Cavalry</b> prefixreval Fast cavalry for scouting and raiding. Resistant to conversion. Strong vs. Monks. Weak vs. Pikemen and Camel Riders.<i> Upgrades: attack, armor (Blacksmith); speed, hit points, to Hussar 500F, 600G or Winged Hussar 600F, 800G (Stable); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26445": "Build <b>Siege Tower</b> prefixreval Quick land transport used to unload units over enemy walls. Resistant to archer attack. Cannot be used by mounted units.<i> Upgrades: more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range› ‹garrison›",
  "26446": "Build <b>Siege Ram</b> prefixreval Anti-building siege weapon. Resistant to most ranged attacks. Garrisoned infantry increase speed and attack.<i> Upgrades: attack (University); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range› ‹garrison›",
  "26447": "Create <b>Boyar</b> prefixreval Slavic unique cavalry unit. Resistant to melee attack.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed, to Elite Boyar 1000F, 600G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range› ",
  "26448": "Build <b>Onager</b> prefixreval Ranged siege weapon with area of effect attack, but cannot attack enemies at close range. Strong vs. tight groups of units. Can attack ground and destroy trees.<i> Upgrades: attack, range (University); to Siege Onager 1450F, 1000G (Siege Workshop); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26449": "Create <b>Elite Boyar</b> prefixreval Slavic unique cavalry unit. Resistant to melee attack.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26451": "Create <b>Elite Cataphract</b> prefixreval Byzantine unique cavalry unit. Strong vs. infantry. Weak vs. archers.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26452": "Create <b>Elite Chu Ko Nu</b> prefixreval Chinese unique archer with rapid-fire attack. Strong vs. infantry. Weak vs. archers and siege weapons.<i> Upgrades: attack, range, armor (Blacksmith); accuracy (Archery Range); attack, accuracy (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26453": "Create <b>Elite Mameluke</b> prefixreval Saracen unique camel unit with ranged melee attack. Strong vs. cavalry. Weak vs. archers.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26454": "Create <b>Elite Huskarl</b> prefixreval Gothic unique infantry unit with high pierce armor. Strong vs. archers and buildings. Weak vs. cavalry.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26455": "Create <b>Elite Janissary</b> prefixreval Turkish unique hand cannoneer with longer range and no minimum range. Strong vs. infantry. Weak vs. archers.<i> Upgrades: armor (Blacksmith); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26456": "Create <b>Elite Longbowman</b> prefixreval British unique archer with very long range. Strong vs. infantry. Weak vs. cavalry and Skirmishers.<i> Upgrades: attack, range, armor (Blacksmith); attack, accuracy (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26457": "Build <b>Elite Longboat</b> prefixreval Viking unique ship that fires multiple arrows. Strong vs. War Galleys, land units, and buildings.<i> Upgrades: armor, speed, cost (Dock); attack, range (Blacksmith); attack, accuracy (University); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26458": "Create <b>Elite Mangudai</b> prefixreval Mongol unique cavalry archer with fast-firing attack. Strong vs. siege weapons and infantry. Weak vs. Skirmishers, Pikemen, and Camel Riders.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); accuracy, armor (Archery Range); attack, accuracy (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26459": "Create <b>Elite War Elephant</b> prefixreval Persian unique unit. Slow and powerful cavalry. Strong vs. buildings and units at close range. Weak vs. Monks.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26460": "Create <b>Elite Samurai</b> prefixreval Japanese unique infantry unit with fast attack. Strong vs. unique units and infantry. Weak vs. archers.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26461": "Create <b>Elite Throwing Axeman</b> prefixreval Frankish unique infantry unit with ranged melee attack. Strong vs. infantry. Weak vs. archers and siege weapons.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26462": "Create <b>Elite Teutonic Knight</b> prefixreval Teutonic unique infantry unit. Slow and powerful. Strong vs. melee units. Weak vs. archers and Scorpions.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26463": "Create <b>Elite Woad Raider</b> prefixreval Celtic unique infantry unit. Fast-moving. Strong vs. infantry and siege weapons. Weak vs. archers and cavalry.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26469": "Create <b>Champion</b> prefixreval All-purpose infantry unit. Strong vs. buildings and infantry. Weak vs. archers at long range.<i> Upgrades: attack, armor (Blacksmith); cost, speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26471": "Create <b>Paladin</b> prefixreval Powerful all-purpose cavalry. Strong vs. infantry and archers. Weak vs. Halberdiers, Heavy Camel Riders, and Monks.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26493": "Build <b>Siege Onager</b> prefixreval Ranged siege weapon with area of effect attack, but cannot attack enemies at close range. Strong vs. tight groups of units. Can attack ground and destroy trees.<i> Upgrades: attack, range (University); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26534": "Create <b>Coustillier</b> prefixreval Burgundian unique cavalry unit which can charge its attack. Strong vs. infantry and archers. Weak vs. Camel Riders and Monks.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed, to Elite Coustillier 1000F, 800G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26536": "Create <b>Elite Coustillier</b> prefixreval Burgundian unique cavalry unit which can charge its attack. Strong vs. infantry and archers. Weak vs. Camel Riders and Monks.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26538": "Create <b>Serjeant</b> prefixreval Sicilian unique infantry unit which can construct Donjons.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed, to Elite Serjeant 1100F, 800G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26540": "Create <b>Elite Serjeant</b> prefixreval Sicilian unique infantry unit which can construct Donjons.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26542": "Create <b>Flemish Militia</b> prefixreval Burgundian unique infantry unit. Strong vs. cavalry. Weak vs. archers.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26558": "Create <b>Obuch</b> prefixreval Polish unique infantry unit which can damage the armor of units it is fighting. Strong vs. buildings and infantry. Weak vs. archers at long range.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed, to Elite Obuch 800F, 600G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26559": "Create <b>Elite Obuch</b> prefixreval Polish unique infantry unit which can damage the armor of units it is fighting. Strong vs. buildings and infantry. Weak vs. archers at long range.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26561": "Build <b>Hussite Wagon</b> prefixreval Bohemian unique siege unit. Units behind it receive 50% less damage from incoming projectiles. Strong vs. archers. Weak vs. siege weapons.<i> Upgrades: attack, range (University); creation speed, to Elite Hussite Wagon 800W, 600G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26563": "Build <b>Elite Hussite Wagon</b> prefixreval Bohemian unique siege unit. Units behind it receive 50% less damage from incoming projectiles. Strong vs. archers. Weak vs. siege weapons.<i> Upgrades: attack, range (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26573": "Build <b>Elite Cannon Galleon</b> prefixreval Anti-building siege warship with long range, but cannot attack enemies at close range. Strong vs. buildings. Weak vs. other units.<i> Upgrades: armor, speed, cost (Dock); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26574": "Create <b>Berserk</b> prefixreval Viking unique infantry unit that slowly heals itself. Strong vs. infantry and siege weapons. Weak vs. archers.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed, to Elite Berserk 1075F, 475G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26576": "Create <b>Elite Berserk</b> prefixreval Viking unique infantry unit that slowly heals itself. Strong vs. infantry and siege weapons. Weak vs. archers.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26577": "Create <b>Winged Hussar</b> prefixreval Unique to Poles and Lithuanians. Fast cavalry for scouting and raiding. Resistant to conversion. Strong vs. Monks and gunpowder units. Weak vs. Pikemen and Camel Riders.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26579": "Build <b>Houfnice</b> prefixreval Bohemian unique siege unit. Siege weapon with long range. Strong vs. buildings and siege weapons. Weak vs. melee units.<i> Upgrades: attack, range (University); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26660": "Create <b>Petard</b> prefixreval Demolition siege unit armed with explosives. Strong vs. buildings. Weak vs. other units. Self-destructs when used.<i> Upgrades: attack (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26661": "Create <b>Hussar</b> prefixreval Fast cavalry for scouting and raiding. Resistant to conversion. Strong vs. Monks. Weak vs. Pikemen and Camel Riders.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26667": "Create <b>Jaguar Warrior</b> prefixreval Aztec unique infantry unit. Strong vs. infantry. Weak vs. cavalry and archers.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed, to Elite Jaguar Warrior 1000F, 500G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26669": "Create <b>Elite Jaguar Warrior</b> prefixreval Aztec unique infantry unit. Strong vs. infantry. Weak vs. cavalry and archers.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26671": "Create <b>Eagle Warrior</b> prefixreval Fast infantry for scouting and raiding. Resistant to conversion. Strong vs. Monks and archers. Weak vs. Long Swordsmen and cavalry.<i> Upgrades: attack, armor (Blacksmith); speed, to Elite Eagle Warrior 800F, 500G (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26672": "Create <b>Eagle Scout</b> prefixreval Fast infantry for scouting and raiding. Resistant to conversion. Strong vs. Monks and archers. Weak vs. Men-at-Arms and cavalry.<i> Upgrades: attack, armor (Blacksmith); speed, to Eagle Warrior 200F, 200G (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26673": "Create <b>Elite Eagle Warrior</b> prefixreval Fast infantry for scouting and raiding. Resistant to conversion. Strong vs. Monks and archers. Weak vs. Long Swordsmen and cavalry.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26675": "Create <b>Tarkan</b> prefixreval Hunnic unique cavalry unit with attack bonus vs. buildings. Strong vs. buildings and archers. Weak vs. Pikemen and Camel Riders.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed, to Elite Tarkan 1000F, 500G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26677": "Create <b>Elite Tarkan</b> prefixreval Hunnic unique cavalry unit with attack bonus vs. buildings. Strong vs. buildings and archers. Weak vs. Pikemen and Camel Riders.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26682": "Create <b>Elephant Archer</b> prefixreval Slow and heavy mounted archer. Strong vs. archers and infantry. Weak vs. Pikemen, Skirmishers, and Camel Riders.<i> Upgrades: attack, range, armor (Blacksmith); speed, hit points (Stable); accuracy, to Elite Elephant Archer 1000F, 800G (Archery Range); attack, accuracy (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26683": "Create <b>Plumed Archer</b> prefixreval Mayan unique fast-moving archer. Strong vs. archers and infantry. Weak vs. cavalry.<i> Upgrades: attack, range, armor (Blacksmith); accuracy (Archery Range); attack, accuracy (University); creation speed, to Elite Plumed Archer 700F, 1000W (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26684": "Create <b>Elite Elephant Archer</b> prefixreval Slow and heavy mounted archer. Strong vs. archers and infantry. Weak vs. Pikemen, Skirmishers, and Camel Riders.<i> Upgrades: attack, range, armor (Blacksmith); speed, hit points (Stable); accuracy (Archery Range); attack, accuracy (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26685": "Create <b>Elite Plumed Archer</b> prefixreval Mayan unique fast-moving archer. Strong vs. archers and infantry. Weak vs. cavalry.<i> Upgrades: attack, range, armor (Blacksmith); accuracy (Archery Range); attack, accuracy (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26686": "Create <b>Kamayuk</b> prefixreval Inca unique spearman with increased attack range. Strong vs. cavalry and infantry. Weak vs. archers.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed, to Elite Kamayuk 900F, 500G  (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26687": "Create <b>Conquistador</b> prefixreval Spanish unique mounted hand cannoneer. Strong vs. infantry. Weak vs. Pikemen, Skirmishers, and Monks.<i> Upgrades: armor (Blacksmith); speed, hit points (Stable); creation speed, to Elite Conquistador 1200F, 600G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26688": "Create <b>Elite Kamayuk</b> prefixreval Inca unique spearman with increased attack range. Strong vs. cavalry and infantry. Weak vs. archers.<i> Upgrades: attack, armor (Blacksmith); speed (Barracks); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26689": "Create <b>Elite Conquistador</b> prefixreval Spanish unique mounted hand cannoneer. Strong vs. infantry. Weak vs. Pikemen, Skirmishers, and Monks.<i> Upgrades: armor (Blacksmith); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26690": "Create <b>Slinger</b> prefixreval Inca unique unit. Ranged anti-infantry unit that cannot attack at close range. Strong vs. infantry. Weak vs. archers and cavalry.<i> Upgrades: attack, range, armor (Blacksmith); accuracy (Archery Range); attack, accuracy (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26691": "Create <b>Missionary</b> prefixreval Spanish unique mounted monk. Converts enemy units and heals friendly units. Faster than Monk but with less sight and range. Strong vs. slow, non-ranged units. Weak vs. Light Cavalry and ranged units. Cannot collect Relics.<i> Upgrades: at Monastery; speed, hit points (Stable).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26723": "Create <b>Genoese Crossbowman</b> prefixreval Italian unique archer. Strong vs. cavalry and infantry. Weak vs. archers and siege weapons.<i> Upgrades: attack, range, armor (Blacksmith); accuracy (Archery Range); attack, accuracy (University); creation speed, to Elite Genoese Crossbowman 900F, 750G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26725": "Create <b>Elite Genoese Crossbowman</b> prefixreval Italian unique archer. Strong vs. cavalry and infantry. Weak vs. archers and siege weapons.<i> Upgrades: attack, range, armor (Blacksmith); accuracy (Archery Range); attack, accuracy (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26727": "Create <b>War Wagon</b> prefixreval Korean unique cavalry archer unit. Strong vs. infantry and archers. Weak vs. Pikemen, Skirmishers, and Camel Riders.<i> Upgrades: attack, range, armor (Blacksmith); speed (Stable); accuracy (Archery Range); attack, accuracy (University); creation speed, to Elite War Wagon 1000W, 800G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26728": "Create <b>Magyar Huszar</b> prefixreval Magyar unique light cavalry unit. Strong vs. siege weapons. Weak vs. Pikemen and Camel Riders.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed, to Elite Magyar Huszar 800F, 600G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26729": "Create <b>Elite War Wagon</b> prefixreval Korean unique cavalry archer unit. Strong vs. infantry and archers. Weak vs. Pikemen, Skirmishers, and Camel Riders.<i> Upgrades: attack, range, armor (Blacksmith); speed (Stable); accuracy (Archery Range); attack, accuracy (University); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26730": "Create <b>Elite Magyar Huszar</b> prefixreval Magyar unique light cavalry unit. Strong vs. siege weapons. Weak vs. Pikemen and Camel Riders.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26731": "Build <b>Turtle Ship</b> prefixreval Korean unique ship. Slow and ironclad. Strong vs. warships and buildings.<i> Upgrades: armor, speed, cost, to Elite Turtle Ship 1000F, 800G (Dock); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "26732": "Build <b>Elite Turtle Ship</b> prefixreval Korean unique ship. Slow and ironclad. Strong vs. warships and buildings.<i> Upgrades: armor, speed, cost (Dock); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "42057": "Create <b>Konnik</b> prefixreval Bulgarian unique cavalry unit that fights on as infantry when felled. Strong vs. infantry and archers. Weak vs. Camel Riders and Monks.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed, to Elite Konnik 1000F, 750G (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "42058": "Create <b>Elite Konnik</b> prefixreval Bulgarian unique cavalry unit that fights on as infantry when felled. Strong vs. infantry and archers. Weak vs. Camel Riders and Monks.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "42096": "Create <b>Ratha</b> prefixreval Bengali unique chariot that can switch between melee and ranged attacks. Strong vs. infantry. Weak vs. Skirmishers and Camel Riders.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed, to Elite Ratha 800F, 800W (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "42097": "Create <b>Elite Ratha</b> prefixreval Bengali unique chariot that can switch between melee and ranged attacks. Strong vs. infantry. Weak vs. Skirmishers and Camel Riders.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›",
  "42104": "Create <b>Ratha</b> prefixreval Bengali unique chariot that can switch between melee and ranged attacks. Strong vs. infantry. Weak vs. Skirmishers and Camel Riders.<i> Upgrades: attack, armor (Blacksmith); speed, hit points (Stable); creation speed, to Elite Ratha 800F, 800W (Castle); more resistant to Monks (Monastery).</i><br>\n‹hp› ‹attack› ‹armor› ‹piercearmor› ‹range›"
}